[AdventShieldbearerArmor X2ArmorTemplate]
FriendlyName="变种人持盾者护甲"
FriendlyNamePlural="变种人持盾者护甲"
BriefSummary="变种人持盾者护甲包含先进的防护技术。经过几次失败的对能量护盾发生器逆向设计的尝试，我们被迫接受了无法将这项技术应用到除了这套盔甲之外的其他应用上的事实。部分困难在于有限的样本可用性和非常复杂的失活协议，我们一直无法破解。每次尝试都会导致一个丢失的生成器。在这一点上，我建议我们满足于修复它们，而不是从翻新的装甲中提取核心。"
TacticalText="<Bullet/>变种人持盾者护甲包含先进的防护技术。经过几次失败的对能量护盾发生器逆向设计的尝试，我们被迫接受了无法将这项技术应用到除了这套盔甲之外的其他应用上的事实。部分困难在于有限的样本可用性和非常复杂的失活协议，我们一直无法破解。每次尝试都会导致一个丢失的生成器。在这一点上，我建议我们满足于修复它们，而不是从翻新的装甲中提取核心。"


[AdventShieldbearerArmorDetectionStat X2AbilityTemplate]
LocFriendlyName="欺骗"
LocLongDescription="变种人在初次接敌中将几乎不可能发现这名士兵。"
LocHelpText="变种人在初次接敌中将几乎不可能发现这名士兵。"
LocFlyOverText="变种人在初次接敌中将几乎不可能发现这名士兵。"
LocPromotionPopupText="<Bullet/> 变种人在初次接敌中将几乎不可能发现这名士兵。"


[AdventShieldbearerArmorUniquePassive X2AbilityTemplate]
LocFriendlyName="重型防御"
LocLongDescription="变种人持盾者的护甲提供更多的护甲保护和天生的护盾发生器。"
LocHelpText="变种人持盾者的护甲提供更多的护甲保护和天生的护盾发生器。"
LocFlyOverText="变种人持盾者的护甲提供更多的护甲保护和天生的护盾发生器。"
LocPromotionPopupText="<Bullet/> 变种人持盾者的护甲提供更多的护甲保护和天生的护盾发生器。"
